app/controllers/posts_controller.rb

  def create
    @posts = Post.all
    @post = @current_user.posts.build(post_params)
    @post.save
    @post.post_imgname = "#{@post.id}_postimage.jpg"
    image = params[:image]
    File.binwrite("public/post_images/#{@post.post_imgname}", image.read)
    if @post.save
---
INSERT INTO "posts" ("user_id", "post_image", "created_at", "updated_at", "item_name", "price") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 4], ["post_image", ".jpg"], ["created_at", "2021-02-20 19:36:48.276049"], ["updated_at", "2021-02-20 19:36:48.276049"], ["item_name", "SHIROのタピオカ"], ["price", 500]]
INSERT INTO "posts" ("user_id", "created_at", "updated_at", "item_name", "price", "comment") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 4], ["created_at", "2021-02-20 20:16:30.122099"], ["updated_at", "2021-02-20 20:16:30.122099"], ["item_name", "SHIROのタピオカ"], ["price", 500], ["comment", "リピートしました"]]

  def update
    @post = Post.find(params[:id])
    @post.update(post_params)
---
UPDATE "posts" SET "updated_at" = ?, "post_imgname" = ? WHERE "posts"."id" = ?  [["updated_at", "2021-02-23 04:46:03.539094"], ["post_imgname", "4_postimage.jpg"], ["id", 4]]