app/controllers/users_controller.rb

  def create
    @user = User.new(email: params[:email],password: params[:password],name: params[:name])
    if @user.save
---
INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "とみこ"], ["email", "tomitomi@buyed.com"], ["password", "tomitomi"], ["created_at", "2021-02-07 05:20:33.963096"], ["updated_at", "2021-02-07 05:20:33.963096"]]